/*
 * Name: OgreTextFinderLocalizable.strings
 * Project: OgreKit
 *
 * Creation Date: Jan 22 2004
 * Author: Isao Sonobe <sonobe@gauge.scphys.kyoto-u.ac.jp>
 * Copyright: Copyright (c) 2004 Isao Sonobe, All rights reserved.
 * License: OgreKit License
 *
 * Encoding: UTF16
 * Tabsize: 4
 */

"Find"			= "検索";	/* the title of the "Find" menu */
"Replace"		= "置換";
"Find All"		= "一括検索";
"Replace All"   = "一括置換";
"Highlight"		= "ハイライト";

/* the titles of buttons */
"OK"		= "OK";
"Cancel"	= "キャンセル";

/* progrss messages */
" (%dsec remaining)"        = " (残り %d秒)";    // sec: second
// Find All
"%d string found."          = "%d文字列を発見しました。";
"%d strings found."         = "%d文字列を発見しました。";
// Replace All
"%d string replaced."       = "%d文字列を置換しました。";
"%d strings replaced."      = "%d文字列を置換しました。";
// Highlight
"%d string highlighted."    = "%d文字列を色付けしました。";
"%d strings highlighted."   = "%d文字列を色付けしました。";

/* finish messages */
// not found
"Not found. (%.3fsec)"							= "見つかりませんでした。(%.3f秒)";
"Not found. (canceled, %.3fsec)"				= "見つかりませんでした。(キャンセルされました。%.3f秒)";
// Find All
"%d string found. (%.3fsec)"					= "%d文字列を発見しました。(%.3f秒)";
"%d strings found. (%.3fsec)"					= "%d文字列を発見しました。(%.3f秒)";
"%d string found. (canceled, %.3fsec)"			= "%d文字列を発見しました。(キャンセルされました。%.3f秒)";
"%d strings found. (canceled, %.3fsec)"			= "%d文字列を発見しました。(キャンセルされました。%.3f秒)";
// Replace All
"%d string replaced. (%.3fsec)"					= "%d文字列を置換しました。(%.3f秒)";
"%d strings replaced. (%.3fsec)"				= "%d文字列を置換しました。(%.3f秒)";
"%d string replaced. (canceled, %.3fsec)"		= "%d文字列を置換しました。(キャンセルされました。%.3f秒)";
"%d strings replaced. (canceled, %.3fsec)"		= "%d文字列を置換しました。(キャンセルされました。%.3f秒)";
// Highlight
"%d string highlighted. (%.3fsec)"				= "%d文字列を色付けしました。(%.3f秒)";
"%d strings highlighted. (%.3fsec)"				= "%d文字列を色付けしました。(%.3f秒)";
"%d string highlighted. (canceled, %.3fsec)"	= "%d文字列を色付けしました。(キャンセルされました。%.3f秒)";
"%d strings highlighted. (canceled, %.3fsec)"   = "%d文字列を色付けしました。(キャンセルされました。%.3f秒)";

/* error messages */
"Error! Uneditable."	= "エラー! 編集不可";
"Missing."				= "行方不明";

/* Find Result Window*/
"Find Result"                   = "検索結果";
"%d string found."				= "%d文字列を発見しました。";
"%d strings found."				= "%d文字列を発見しました。";
"Found in %d item."				= "%d項目内で発見しました。";
"Found in %d items."            = "%d項目内で発見しました。";
"Find String: %@"               = "検索文字列: %@";
"Line"                          = "行";
"Found String"                  = "文字列";
"Live Update"                   = "自動更新";
"Selected string not found."	= "選択された文字列を発見できませんでした。"; /* error message */

